#include <iostream>

using namespace std ;


int main() {
    double a1, a100, d, n, s ;
    cout << "Введите первый и сотый члены арифметической прогрессии:" ;
    cin >> a1 >> a100 ;
    if (a1!=a100) {
        if (a100>a1) d = (a100 - a1) / 99 ;
        else d = (a1-a100) / 99 ;
        cout << "Разность арифметической прогрессии = " << d  << endl;
        cout << "Введите ваш номер в журнале n:" ;
        cin >> n ;
        s = (2*a1 + d * (n-1))/2 * n ;
        cout << "Сумма n первых членов арифметической прогрессии = " << s << endl ;
    }
    else cout << "Ошибка!!! Введите разные числа" ;
    return 0 ;
}
